In [1]:
import numpy as np
import pandas as pd

In [ ]:
## Series In Pandas

In [7]:
label = ['a','b','c']
arr=np.array([1,2,3])
my_list = [3,'a',5]
my_dict = {1:10,2:20,3:30}

In [3]:
pd.Series([100,200,300])

0    100
1    200
2    300
dtype: int64

In [4]:
pd.Series(arr,label)

a    1
b    2
c    3
dtype: int32

In [5]:
pd.Series(arr,my_list)

3    1
4    2
5    3
dtype: int32

In [8]:
pd.Series(my_list,label)

a    3
b    a
c    5
dtype: object

In [9]:
pd.Series(my_dict)

1    10
2    20
3    30
dtype: int64

In [10]:
## Data Frames in Pandas

In [11]:
## ---> this is how we can create the Data Frames in the Pandas

In [16]:
data={
    "name":["Arpit","Aman","Gouri","Sia"],
    "Age":[19,17,15,12],
    "Score":[95,85,75,100]
}

In [17]:
pd.DataFrame(data)

    name  Age  Score
0  Arpit   19     95
1   Aman   17     85
2  Gouri   15     75
3    Sia   12    100

In [18]:
data_list = [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
]
pd.DataFrame(data_list)

       0   1         2      3
0   John  28  New York  65000
1   Anna  34     Paris  70000
2  Peter  29    Berlin  62000
3  Linda  42    London  85000

In [24]:
col = ["Name","Age","Location","Salary"]
df=pd.DataFrame(data_list,columns=col)
df

    Name  Age  Location  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [23]:
##---->How to Select a paticular col from the dataframe

In [25]:
df["Name"]

0     John
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object

In [27]:
df[["Name","Location"]]

    Name  Location
0   John  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

In [28]:
## ---> Creating a new col

In [29]:
df["Role"] = ["Doc","Eng","teacher","Doc"]

In [30]:
df

    Name  Age  Location  Salary     Role
0   John   28  New York   65000      Doc
1   Anna   34     Paris   70000      Eng
2  Peter   29    Berlin   62000  teacher
3  Linda   42    London   85000      Doc

In [34]:
few_info=df[["Name","Salary","Role"]]

In [35]:
few_info

    Name  Salary     Role
0   John   65000      Doc
1   Anna   70000      Eng
2  Peter   62000  teacher
3  Linda   85000      Doc

In [36]:
## Deleting col

In [37]:
df

    Name  Age  Location  Salary     Role
0   John   28  New York   65000      Doc
1   Anna   34     Paris   70000      Eng
2  Peter   29    Berlin   62000  teacher
3  Linda   42    London   85000      Doc

In [38]:
df.drop("Role",axis=1)

    Name  Age  Location  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [39]:
df

    Name  Age  Location  Salary     Role
0   John   28  New York   65000      Doc
1   Anna   34     Paris   70000      Eng
2  Peter   29    Berlin   62000  teacher
3  Linda   42    London   85000      Doc

In [40]:
## So to remove the Role from the memory we can use the inplace

In [41]:
df.drop("Role",axis=1,inplace=True)

In [42]:
df

    Name  Age  Location  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [43]:
## Deleting the row

In [44]:
df.drop(2,axis=0)

    Name  Age  Location  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
3  Linda   42    London   85000

In [45]:
df

    Name  Age  Location  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [46]:
## we can use inplace to delete it from the memory

In [47]:
## axis =0 is used for "X" means row 
## axis = 1 is used for "Y" means col